Solver/openfoam6/tutorials/elasticCircularCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          880;
        startFace       376000;
    }
    outlet
    {
        type            patch;
        nFaces          720;
        startFace       376880;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       377600;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          6400;
        startFace       379200;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          6400;
        startFace       385600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
